{"meta":{"title":"Hexo","subtitle":null,"description":null,"author":"John Doe","url":"http://yoursite.com","root":"/"},"pages":[{"title":"about","date":"2019-08-08T06:46:20.000Z","updated":"2019-08-08T06:46:20.635Z","comments":true,"path":"about/index.html","permalink":"http://yoursite.com/about/index.html","excerpt":"","text":""}],"posts":[{"title":"如何使用代理","slug":"ProxyTutorial","date":"2019-11-15T07:45:13.000Z","updated":"2019-11-15T09:24:11.552Z","comments":true,"path":"2019/11/15/ProxyTutorial/","link":"","permalink":"http://yoursite.com/2019/11/15/ProxyTutorial/","excerpt":"","text":"1.代理是什么？可能有对此接触很少的同学，所以这里大致的描述下，代理服务器是介于浏览器和Web服务器之间的一台服务器，有了它之后，浏览器不是直接到Web服务器去取回网页而是向代理服务器发出请求，Request信号会先送到代理服务器，由代理服务器来取回浏览器所需要的信息并传送给你的浏览器。你可以简单的理解为，代理服务器是一个传话的小兵。那么代理服务器能干什么呢？ 隐藏真实IP：上网者可以通过这种方法隐藏自己的IP，免受攻击。 访问一些单位或团体内部资源，如某大学FTP(前提是该代理地址在该资源 的允许访问范围之内)，使用教育网内地址段免费代理服务器，就可以用于对教育网开放的各类FTP下载上传，以及各类资料查询共享等服务。 突破自身IP访问限制，访问国外站点。教育网、169网等网络用户可以通过代理访问国外网站。 突破中国电信的IP封锁：中国电信用户有很多网站是被限制访问的，这种限制是人为的，不同Serve对地址的封锁是不同的。所以不能访问时可以换一个国 外的代理服务器试试。 提高访问速度：通常代理服务器都设置一个较大的硬盘缓冲区，当有外界的信息通过时，同时也将其保存到缓冲区中，当其他用户再访问相同的信息时， 则直接由缓冲区中取出信息，传给用户，以提高访问速度。 相信你点进这个教程多半也是有自己使用代理服务器的原因，所以这里就不多赘述。 2.我才不想管什么狗屁原理，我只想知道我该怎么用？好的，我理解。但是就像刚刚提到的，代理服务器作为一个传话的小兵，它并不是平白无故存在的，你需要这个小兵的使用权限，也就是账号密码。或者对于SS或者Vmess的协议来说，可能是一张二维码或者一串乱码字符串(是账号密码的另一种表现形式)根据你的需求不同呢，账号密码的来源一般也不同，来源很多种，比如自己搭建，或者找公司的网管要，或者找别人搭建，或者找别人借，或者去网络上蹭免费的，或者自己找服务商买等等等等。要说明的是，我们并不提供代理服务器。至于去哪里购买或者其他的获取渠道，基本上还是需要你自己去决定。你可以根据你的需求去网络上搜索一下，基本上会有你想要的结果。如果你足够懒，下面有一些网络上简单搜集到的资料，我不确定是否有用，也不能确定是否存在不妥，烦请各自甄别。 免费申请谷歌云 免费申请Google Cloud谷歌云300美元及开设台湾/香港云主机 V2Ray一键安装脚本 白嫖机场 V2Ray搭建详细图文教程 百度百科-代理 3.我总算靠自己的努力搞到了账号密码，接下来呢？看到这里我相信你已经轻而易举的搞定了账号密码的问题。 如果你手中的是一张包含账号信息的二维码，那你可以点击下图中的扫描按钮，扫描到你的账号信息后会自动添加到信息栏中，点击完成并去第5步。 如果你手中是账号密码的明文形式，那你可以点击设置中的代理管理，如下图 然后点击右上角的添加 在下面的界面中填入你的账号信息并保存 接下来去代理管理界面中选中刚刚的节点（单击一下） 在设置页打开启用proxy的开关。 大功告成！怎么样，是不是很简单呢？","categories":[],"tags":[{"name":"教程","slug":"教程","permalink":"http://yoursite.com/tags/教程/"}]},{"title":"隐私使用条款","slug":"Privacy","date":"2019-08-08T07:09:47.000Z","updated":"2019-08-08T09:51:02.569Z","comments":true,"path":"2019/08/08/Privacy/","link":"","permalink":"http://yoursite.com/2019/08/08/Privacy/","excerpt":"","text":"1.我们收集什么？我们不收集您创建的任何内容我们只匿名收集下列应用的使用信息： 用户在每个应用页面上花费的时间。 App的崩溃信息。 所有数据都是匿名的。我们不知道是谁产生了以上信息，所有数据都只会与AppCenter统计服务共享。 2.我们使用哪些第三方服务我们使用微软的AppCenter来分析匿名使用数据。 3.你如何删除你的数据？由于您的所有数据都保存在设备内，因此您可通过删除应用来删除您可能保留在设备内的缓存数据。","categories":[],"tags":[{"name":"Privacy","slug":"Privacy","permalink":"http://yoursite.com/tags/Privacy/"}]}]}